In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('data.csv')

In [4]:
data.head(3)

# 2016-03-02T11:49:34Z, 2016-03-02T11:49:34Z, 2016-10-14T01:58:25Z

,id,address,categories,city,cuisines,dateAdded,dateUpdated,latitude,longitude,menus.category,menus.currency,menus.dateSeen,menus.description,menus.name,name,province
0,AVwc__cikufWRAb51QjV,610 Commercial St,"Restaurant Delivery Service,Restaurants,Pizza,...",Atchison,Restaurant Delivery Service,2016-03-02T11:49:34Z,2017-02-01T18:04:44Z,39.561570,-95.121020,NaN,NaN,2017-02-01T18:04:44Z,NaN,Taco,Gambino's Pizza,KS
1,AVwc__cikufWRAb51QjV,610 Commercial St,"Restaurant Delivery Service,Restaurants,Pizza,...",Atchison,Restaurant Delivery Service,2016-03-02T11:49:34Z,2017-02-01T18:04:44Z,39.561570,-95.121020,NaN,NaN,2016-03-02T11:49:34Z,"Beef, onion, cheddar cheese, lettuce, refried...",Taco,Gambino's Pizza,KS
2,AVwc__dF_7pvs4fz1Ncy,9521 Morton Davis Dr,"Golf Course, American Restaurant, and Resort",Patterson,NaN,2016-10-14T01:58:25Z,2016-10-14T01:58:25Z,37.401855,-121.266703,NaN,NaN,2016-10-14T01:58:25Z,"Beef barbacoa or chicken, spanish rice, pico d...",Smotherd Burrito,Diablo Grande Golf & Country Club,Grayson

In [5]:
data.dtypes

id                    object
address               object
categories            object
city                  object
cuisines              object
dateAdded             object
dateUpdated           object
latitude             float64
longitude            float64
menus.category        object
menus.currency        object
menus.dateSeen        object
menus.description     object
menus.name            object
name                  object
province              object
dtype: object

In [6]:
print(data['city'].dtype, data['latitude'].dtype)

object float64

In [7]:
data.describe()

           latitude     longitude
count  55636.000000  55636.000000
mean      36.694846    -98.713309
std        4.835124     18.245857
min      -31.986438   -159.492690
25%       33.668355   -117.647150
50%       36.047195    -96.682320
75%       40.588380    -82.679930
max       61.219460    115.903696

In [8]:
data.shape

(77260, 16)

In [9]:
data.dropna().shape

(1925, 16)

In [10]:
data.shape

(77260, 16)

In [11]:
california_data_idx = data[data['city'] == 'California'].index
california_data_idx

Index([40483, 52930, 52931, 52932, 52933, 52934, 52935, 52936, 52937, 52938,
       52939, 65070],
      dtype='int64')

In [12]:
TakoBell_california_data_idx = data[(data['city'] == 'California') & (data['name'] == 'Taco Bell')].index
TakoBell_california_data_idx

Index([52930, 52931, 52932, 52933, 52934, 52935, 52936, 52937, 52938, 52939], dtype='int64')

In [13]:
result = data[((data['name'] == 'Taco Bell') | (data['city'] == 'New York')) & (~(data['menus.name'].str.contains('Volcano Taco', na=False))) & (~(data['menus.name'].str.contains('Fresco Soft Taco', na=False)))]

In [14]:
result = data[(~(data['menus.currency'].isna()))]

In [15]:
data['categories']

0        Restaurant Delivery Service,Restaurants,Pizza,...
1        Restaurant Delivery Service,Restaurants,Pizza,...
2             Golf Course, American Restaurant, and Resort
3                                     Fast Food Restaurant
4        Mexican Restaurant Mid-City West,Mexican Resta...
                               ...
77255                                           Restaurant
77256                                           Restaurant
77257                                           Restaurant
77258                                           Restaurant
77259                                           Restaurant
Name: categories, Length: 77260, dtype: object

In [16]:
data.groupby('city').count().sort_values('name', ascending=False).head(5)

# San Diego, Los Angeles, Chicago, San Francisco, New York

,id,address,categories,cuisines,dateAdded,dateUpdated,latitude,longitude,menus.category,menus.currency,menus.dateSeen,menus.description,menus.name,name,province
city,,,,,,,,,,,,,,,
San Diego,1924,1924,1924,546,1924,1924,879,879,139,1103,1924,745,1924,1924,1924
Los Angeles,1603,1603,1603,600,1603,1603,819,819,166,1098,1603,745,1603,1603,1603
Chicago,1186,1186,1186,394,1186,1186,671,671,104,976,1186,537,1186,1186,1186
San Francisco,1120,1120,1120,504,1120,1120,605,605,36,878,1120,547,1120,1117,1117
New York,1085,1085,1085,545,1085,1085,649,649,216,803,1085,474,1085,1085,1085

In [17]:
import pandas as pd
result = pd.Series(data[data['name'] == 'Taco Bell'].groupby('city').size().sort_values(ascending=False).head(5))
result

# Indianapolis, Columbus, Charleston, Tampa, Fresno

city
Indianapolis    84
Columbus        63
Charleston      63
Tampa           62
Fresno          42
dtype: int64

In [18]:
data['dateAdded'] = pd.to_datetime(data['dateAdded'])
data[data['dateAdded'].dt.month == 10].head(5).index

Index([2, 21, 22, 23, 24], dtype='int64')

In [19]:
data['dateAdded'] = pd.to_datetime(data['dateAdded'])
result = pd.DataFrame(data.groupby(data['dateAdded'].dt.month)['id'].nunique())
result

             id
dateAdded
1           308
2           257
3          4970
4          3224
5          1141
6          1356
7           645
8           479
9           554
10         4716
11         1550
12          239

In [20]:
import pandas as pd
data['update_delta'] = (pd.to_datetime(data['dateUpdated']) - pd.to_datetime(data['dateAdded'])).dt.days
result = data.groupby('city', as_index=False).agg({'update_delta': 'mean', 'latitude': 'max'})

zep_mean = result[result['city'] == 'Zephyrhills']['update_delta'].values[0]

In [21]:
data[data['categories'].str.contains('Pizza', na=False)]['name'].index[2]

66

In [22]:
import pandas as pd
import numpy as np
data['update_delta'] = (pd.to_datetime(data['dateUpdated']) - pd.to_datetime(data['dateAdded'])).dt.days
print(np.round(data['update_delta'].mean(), 2), np.round(data['update_delta'].median(), 2))

326.22 364.0

In [23]:
import pandas as pd
import numpy as np

result = np.round(data[data['categories'].str.split(',').apply(len) > 20].groupby('province').agg({'longitude' : 'min'}), 3)

result.to_csv('result.csv', sep=';')